class Helper {
    constructor() {

    }

    zodiacOrder = (currentId) => {
        const result = [];

        // currentId down to 1
        for (let i = currentId; i >= 1; i--) {
            result.push(i);
        }

        // 12 down to currentId + 1
        for (let i = 12; i > currentId; i--) {
            result.push(i);
        }

        return result;
    }

    zodiac = () => {
        return [
            { id: 1, name: '鼠', key: 'rat' },
            { id: 2, name: '牛', key: 'ox' },
            { id: 3, name: '虎', key: 'tiger' },
            { id: 4, name: '兔', key: 'rabbit' },
            { id: 5, name: '龙', key: 'dragon' },
            { id: 6, name: '蛇', key: 'snake' },
            { id: 7, name: '马', key: 'horse' },
            { id: 8, name: '羊', key: 'goat' },
            { id: 9, name: '猴', key: 'monkey' },
            { id: 10, name: '鸡', key: 'rooster' },
            { id: 11, name: '狗', key: 'dog' },
            { id: 12, name: '猪', key: 'pig' }
        ];
    }

    comparisons = () => {
        return [
            { id: 1, numbers: [1, 13, 25, 37, 49] },
            { id: 2, numbers: [2, 14, 26, 38] },
            { id: 3, numbers: [3, 15, 27, 39] },
            { id: 4, numbers: [4, 16, 28, 40] },
            { id: 5, numbers: [5, 17, 29, 41] },
            { id: 6, numbers: [6, 18, 30, 42] },
            { id: 7, numbers: [7, 19, 31, 43] },
            { id: 8, numbers: [8, 20, 32, 44] },
            { id: 9, numbers: [9, 21, 33, 45] },
            { id: 10, numbers: [10, 22, 34, 46] },
            { id: 11, numbers: [11, 23, 35, 47] },
            { id: 12, numbers: [12, 24, 36, 48] }
        ]
    }

    zodiacNumbers = () => {
        return [
            { id: 1, num: "01", wuxing: "火", color: "red", old_even: "odd" },
            { id: 2, num: "02", wuxing: "火", color: "red", old_even: "even" },
            { id: 3, num: "03", wuxing: "金", color: "blue", old_even: "odd" },
            { id: 4, num: "04", wuxing: "金", color: "blue", old_even: "even" },
            { id: 5, num: "05", wuxing: "土", color: "green", old_even: "odd" },
            { id: 6, num: "06", wuxing: "土", color: "green", old_even: "even" },
            { id: 7, num: "07", wuxing: "木", color: "red", old_even: "odd" },
            { id: 8, num: "08", wuxing: "木", color: "red", old_even: "even" },
            { id: 9, num: "09", wuxing: "火", color: "blue", old_even: "odd" },
            { id: 10, num: "10", wuxing: "火", color: "blue", old_even: "even" },
            { id: 11, num: "11", wuxing: "金", color: "green", old_even: "even" },
            { id: 12, num: "12", wuxing: "金", color: "red", old_even: "odd" },
            { id: 13, num: "13", wuxing: "水", color: "red", old_even: "even" },
            { id: 14, num: "14", wuxing: "水", color: "blue", old_even: "odd" },
            { id: 15, num: "15", wuxing: "木", color: "blue", old_even: "even" },
            { id: 16, num: "16", wuxing: "木", color: "green", old_even: "odd" },
            { id: 17, num: "17", wuxing: "火", color: "green", old_even: "even" },
            { id: 18, num: "18", wuxing: "火", color: "red", old_even: "odd" },
            { id: 19, num: "19", wuxing: "土", color: "red", old_even: "even" },
            { id: 20, num: "20", wuxing: "土", color: "blue", old_even: "even" },
            { id: 21, num: "21", wuxing: "水", color: "green", old_even: "odd" },
            { id: 22, num: "22", wuxing: "水", color: "green", old_even: "even" },
            { id: 23, num: "23", wuxing: "木", color: "red", old_even: "odd" },
            { id: 24, num: "24", wuxing: "木", color: "red", old_even: "even" },
            { id: 25, num: "25", wuxing: "金", color: "blue", old_even: "odd" },
            { id: 26, num: "26", wuxing: "金", color: "blue", old_even: "even" },
            { id: 27, num: "27", wuxing: "土", color: "green", old_even: "odd" },
            { id: 28, num: "28", wuxing: "土", color: "green", old_even: "even" },
            { id: 29, num: "29", wuxing: "水", color: "red", old_even: "odd" },
            { id: 30, num: "30", wuxing: "水", color: "red", old_even: "odd" },
            { id: 31, num: "31", wuxing: "火", color: "blue", old_even: "even" },
            { id: 32, num: "32", wuxing: "火", color: "green", old_even: "odd" },
            { id: 33, num: "33", wuxing: "金", color: "green", old_even: "even" },
            { id: 34, num: "34", wuxing: "金", color: "red", old_even: "odd" },
            { id: 35, num: "35", wuxing: "土", color: "red", old_even: "even" },
            { id: 36, num: "36", wuxing: "土", color: "blue", old_even: "odd" },
            { id: 37, num: "37", wuxing: "木", color: "blue", old_even: "even" },
            { id: 38, num: "38", wuxing: "木", color: "green", old_even: "odd" },
            { id: 39, num: "39", wuxing: "火", color: "green", old_even: "even" },
            { id: 40, num: "40", wuxing: "火", color: "red", old_even: "even" },
            { id: 41, num: "41", wuxing: "金", color: "blue", old_even: "odd" },
            { id: 42, num: "42", wuxing: "金", color: "blue", old_even: "even" },
            { id: 43, num: "43", wuxing: "水", color: "green", old_even: "odd" },
            { id: 44, num: "44", wuxing: "水", color: "green", old_even: "even" },
            { id: 45, num: "45", wuxing: "木", color: "red", old_even: "odd" },
            { id: 46, num: "46", wuxing: "木", color: "red", old_even: "even" },
            { id: 47, num: "47", wuxing: "火", color: "blue", old_even: "odd" },
            { id: 48, num: "48", wuxing: "火", color: "blue", old_even: "even" },
            { id: 49, num: "49", wuxing: "土", color: "green", old_even: "odd" }
        ];
    }

    zodiacAttributes = () => {
        return {
            "家禽": ["牛","马","羊","鸡","狗","猪"],
            "野兽": ["鼠","虎","兔","龙","蛇","猴"],
            "吉美": ["兔","龙","蛇","马","羊","鸡"],
            "凶丑": ["鼠","牛","虎","猴","狗","猪"],
            "阴肖": ["鼠","龙","蛇","马","狗","猪"],
            "阳肖": ["牛","虎","兔","羊","猴","鸡"],
            "单笔": ["鼠","龙","马","蛇","鸡","猪"],
            "双笔": ["虎","猴","狗","兔","羊","牛"],
            "天肖": ["兔","马","猴","猪","牛","龙"],
            "地肖": ["蛇","羊","鸡","狗","鼠","虎"],
            "白肖": ["鼠","牛","虎","鸡","狗","猪"],
            "黑肖": ["兔","龙","蛇","马","羊","猴"],
            "女肖": ["兔","蛇","羊","鸡","猪"],
            "男肖": ["鼠","牛","虎","龙","马","猴","狗"],
            "琴肖": ["兔","蛇","鸡"],
            "棋肖": ["鼠","牛","狗"],
            "书肖": ["虎","龙","马"],
            "画肖": ["羊","猴","猪"],
            "五福": ["鼠","虎","兔","蛇","猴","龙"],
            "红肖": ["马","兔","鼠","鸡"],
            "蓝肖": ["蛇","虎","猪","猴"],
            "绿肖": ["羊","龙","牛","狗"],
            "文肖": ["鼠","兔","龙","羊","鸡","猪"],
            "武肖": ["牛","虎","蛇","马","猴","狗"],
            "前肖": ["鼠","牛","虎","兔","龙","蛇"],
            "后肖": ["马","羊","猴","鸡","狗","猪"],
            "吴国": ["虎","兔","龙","蛇"],
            "蜀国": ["马","羊","猴","鸡"],
            "魏国": ["鼠","牛","狗","猪"],
            "独肖": ["鼠","牛","虎","兔","马","羊"],
            "合肖": ["龙","蛇","猴","鸡","狗","猪"],
            "春肖": ["兔","虎","龙"],
            "夏肖": ["羊","蛇","马"],
            "秋肖": ["狗","鸡","猴"],
            "冬肖": ["猪","牛","鼠"],
            "肉肖": ["虎","蛇","龙","狗"],
            "菜肖": ["猪","鼠","鸡","猴"],
            "草肖": ["牛","羊","马","兔"],
            "风肖": ["虎","兔","龙"],
            "雨肖": ["蛇","马","羊"],
            "雷肖": ["猴","鸡","狗"],
            "电肖": ["鼠","牛","猪"],
            "笔肖": ["鸡","兔","蛇"],
            "墨肖": ["鼠","牛","狗"],
            "纸肖": ["马","龙","虎"],
            "砚肖": ["羊","猴","猪"],
            "夜肖": ["鼠","牛","虎","鸡","狗","猪"],
            "日肖": ["兔","龙","蛇","马","羊","猴"],
            "左肖": ["鼠","牛","龙","蛇","猴","鸡"],
            "右肖": ["虎","兔","马","羊","狗","猪"],
            "东肖": ["兔","龙","蛇"],
            "南肖": ["马","羊","猴"],
            "西肖": ["鸡","狗","猪"],
            "北肖": ["牛","鼠","虎"],
            "朝肖": ["龙","兔","蛇","马","羊","猴"],
            "夕肖": ["鼠","牛","虎","狗","猪","鸡"],
            "两大君王": ["龙","虎"],
            "两大恶人": ["鼠","猴"],
            "四大美女": ["兔","蛇","羊","鸡"],
            "四大家臣": ["牛","马","猪","狗"],
            "01月": ["鼠","羊","虎","蛇"],
            "02月": ["牛","马","兔","鼠"],
            "03月": ["虎","蛇","龙","牛"],
            "04月": ["兔","龙","蛇","猴"],
            "05月": ["龙","兔","马","兔"],
            "06月": ["蛇","虎","羊","狗"],
            "07月": ["马","牛","猴","猪"],
            "08月": ["羊","鼠","鸡","马"],
            "09月": ["猴","猪","狗","羊"],
            "10月": ["鸡","狗","猪","虎"],
            "11月": ["狗","鸡","鼠","鸡"],
            "12月": ["猪","猴","牛","龙"],
            "胆大": ["牛","虎","马","猴","狗","猪"],
            "胆小": ["鼠","兔","龙","蛇","羊","鸡"],
            "三合1": ["鼠","龙","猴"],
            "三合2": ["牛","蛇","鸡"],
            "三合3": ["虎","马","狗"],
            "三合4": ["兔","羊","猪"],
            "六合1": ["鼠","牛"],
            "六合2": ["龙","鸡"],
            "六合3": ["虎","猪"],
            "六合4": ["蛇","猴"],
            "六合5": ["兔","狗"],
            "六合6": ["马","羊"],
            "有肖": ["龙","蛇","猴","鸡","狗","猪"],
            "无肖": ["鼠","牛","虎","兔","马","羊"],
            "肥肖": ["龙","虎","猴","鼠","牛","猪"],
            "瘦肖": ["狗","兔","蛇","马","羊","鸡"],
            "梅肖": ["兔","鸡","蛇"],
            "兰肖": ["鼠","牛","狗"],
            "竹肖": ["马","龙","虎"],
            "菊肖": ["羊","猴","猪"],
            "大肖": ["牛","虎","马","羊","狗","猪"],
            "小肖": ["鼠","兔","龙","蛇","猴","鸡"],
            "三公天肖": ["鼠","兔","马","鸡"],
            "三公地肖": ["牛","龙","羊","狗"],
            "三公人肖": ["虎","蛇","猴","猪"],
            "有边": ["龙","蛇","猴","鸡","狗","猪"],
            "无边": ["鼠","牛","虎","兔","马","羊"],
            "1号汉奸汪精卫": ["猪","狗","鼠"],
            "2号汉奸陈公博": ["牛","虎","蛇"],
            "3号汉奸周佛海": ["马","兔","羊"],
            "4号汉奸梁鸿志": ["龙","鸡","猴"]
        }
    }

    yearZodiac = () => {
        return [
            { animal: "rat", from_date: "2020-01-25", to_date: "2021-02-11" },
            { animal: "ox", from_date: "2021-02-12", to_date: "2022-01-31" },
            { animal: "tiger", from_date: "2022-02-01", to_date: "2023-01-21" },
            { animal: "rabbit", from_date: "2023-01-22", to_date: "2024-02-09" },
            { animal: "dragon", from_date: "2024-02-10", to_date: "2025-01-28" },
            { animal: "snake", from_date: "2025-01-29", to_date: "2026-02-16" },
            { animal: "horse", from_date: "2026-02-17", to_date: "2027-02-05" },
            { animal: "goat", from_date: "2027-02-06", to_date: "2028-01-25" },
            { animal: "monkey", from_date: "2028-01-26", to_date: "2029-02-12" },
            { animal: "rooster", from_date: "2029-02-13", to_date: "2030-02-02" },
            { animal: "dog", from_date: "2030-02-03", to_date: "2031-01-22" }
        ];
    }

    getWuxingById = (num) => {
        const zodiacNumbers = this.zodiacNumbers();
        const result = zodiacNumbers.find(item => item.id === num);
        return result ? result.wuxing : null;
    }

    RULES = () => {
        return {
            // 大
            DA: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14],
            // 小
            XIAO: [15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28],
            // 单
            DAN: [1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27],
            // 双
            SHUANG: [2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28],
            // 合大
            HEDA: [10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24],
            // 合小
            HEXIAO: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9],
            // 合单
            HEDAN: [1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23],
            // 合双
            HESHUANG: [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22],
            // 天肖
            TIANXIAO: [1, 5, 9, 13, 17, 21],
            // 地肖
            DIXIAO: [2, 6, 10, 14, 18, 22],
            // 前肖
            QIANXIAO: [3, 7, 11, 15, 19, 23],
            // 后肖
            HOUXIAO: [4, 8, 12, 16, 20, 24],
            // 家肖
            JIAXIAO: [5, 9, 13, 17, 21, 25],
            // 野肖
            YEXIAO: [6, 10, 14, 18, 22, 26],
            // 尾大
            WEIDA: [5, 6, 7, 8, 9],
            // 尾小
            WEIXIAO: [0, 1, 2, 3, 4],
            // 大单
            DADAN: [1, 3, 5, 7, 9],
            // 小单
            XIAODAN: [15, 17, 19, 21, 23, 25, 27],
            // 大双
            DASHUANG: [2, 4, 6, 8, 10, 12, 14],
            // 小双
            XIAOSHUAANG: [16, 18, 20, 22, 24, 26, 28],
            // 绿波
            LV: [2, 3, 7, 8, 12, 13, 17, 18, 22, 23, 27, 28],
            // 红波
            HONG: [1, 6, 9, 14, 15, 20, 21, 26],
            // 蓝波
            LAN: [4, 5, 10, 11, 16, 19, 24, 25],
            // 红单
            HONG_DAN: [1, 9, 15, 21],
            // 蓝单
            LAN_DAN: [5, 19],
            // 绿单
            LV_DAN: [3, 7, 13, 17, 23],
            // 红双
            HONG_SHUANG: [6, 14, 20, 26],
            // 蓝双
            LAN_SHUANG: [4, 10, 16, 24],
            // 绿双
            LV_SHUANG: [2, 8, 12, 18, 22, 28],
            // 红大
            HONG_DA: [6, 9, 14, 15, 20, 21, 26],
            // 蓝大
            LAN_DA: [4, 5, 10, 11, 16, 19, 24, 25],
            // 绿大
            LV_DA: [2, 3, 7, 8, 12, 13, 17, 18, 22, 23, 27, 28],
            // 红小
            HONG_XIAO: [1, 6, 9, 15, 21],
            // 蓝小
            LAN_XIAO: [4, 5, 10, 11, 16, 19, 24, 25],
            // 绿小
            LV_XIAO: [2, 3, 7, 8, 12, 13, 17, 18, 22, 23, 27, 28],
            // 红大单
            HONG_DA_DAN: [9, 15, 21],
            // 蓝大单
            LAN_DA_DAN: [5, 19],
            // 绿大单
            LV_DA_DAN: [3, 7, 13, 17, 23],
            // 红大双
            HONG_DA_SHUANG: [6, 14, 20, 26],
            // 蓝大双
            LAN_DA_SHUANG: [4, 10, 16, 24],
            // 绿大双
            LV_DA_SHUANG: [2, 8, 12, 18, 22, 28],
            // 红小单
            HONG_XIAO_DAN: [1, 9, 15, 21],
            // 蓝小单
            LAN_XIAO_DAN: [5, 19],
            // 绿小单
            LV_XIAO_DAN: [3, 7, 13, 17, 23],
            // 红小双
            HONG_XIAO_SHUANG: [6, 14, 20, 26],
            // 蓝小双
            LAN_XIAO_SHUANG: [4, 10, 16, 24],
            // 绿小双
            LV_XIAO_SHUANG: [2, 8, 12, 18, 22, 28],
            // 0头 | 1头 | 2头 | 3头 | 4头
            "0TOU": [1,2,3,4,5,6,7,8,9],
            "1TOU": [10,11,12,13,14,15,16,17,18,19],
            "2TOU": [20,21,22,23,24,25,26,27,28,29],
            "3TOU": [30,31,32,33,34,35,36,37,38,39],
            "4TOU": [40,41,42,43,44,45,46,47,48,49],
            // 0尾 | 1尾 | 2尾 | 3尾 | 4尾 | 5尾 | 6尾 | 7尾 | 8尾 | 9尾
            "0WEI": [10, 20, 30, 40],
            "1WEI": [1, 11, 21, 31, 41],
            "2WEI": [2, 12, 22, 32, 42],
            "3WEI": [3, 13, 23, 33, 43],
            "4WEI": [4, 14, 24, 34, 44],
            "5WEI": [5, 15, 25, 35, 45],
            "6WEI": [6, 16, 26, 36, 46],
            "7WEI": [7, 17, 27, 37, 47],
            "8WEI": [8, 18, 28, 38, 48],
            "9WEI": [9, 19, 29, 39, 49],
            // 金 | 木 | 水 | 火 | 土
            JIN: [3, 4, 11, 12, 25, 26, 33, 34, 41, 42],
            MU: [7, 8, 13, 14, 17, 18, 23, 24, 27, 28],
            SHUI: [2, 3, 6, 7, 8, 12, 13, 17, 18, 22, 23, 27, 28],
            HUO: [1, 6, 9, 10, 15, 16, 19, 20, 21, 26, 29, 30, 33, 34, 37, 38, 39, 40],
            TU: [5, 6, 11, 12, 25, 26, 35, 36, 45, 46, 49],
        }
    }
}

module.exports = Helper;